//*****************************************************************************
//	 [ .cpp ]
//	Author : KOTARO NAGASAKI
//*****************************************************************************

//*****************************************************************************
//	インクルード定義
//*****************************************************************************
#include "CObj2D.h"

//=============================================================================
//	クラス定義
//=============================================================================
class CFireWork : public CObj2D
{
public:

	CFireWork(OBJTYPE _objType, int _priority);
	~CFireWork();

	void Init();
	void Update();
	void Draw();

	//	typeによっていろんな花火にできたら面白いかも
	static CFireWork* Create(
		LPDIRECT3DDEVICE9 _device,
		D3DXVECTOR3 _pos,
		D3DXVECTOR3 _vec,
		int _type);

	virtual void setVtxBuff();

	virtual void Fire();

private:

	D3DXVECTOR3 vec;
};

//-----------------------------------EOF---------------------------------------