//*****************************************************************************
//	キーボード処理 [CKeyboard.h]
//	Author : KOTARO NAGASAKI
//*****************************************************************************
#ifndef _CKEYBOARD_H_
#define _CKEYBOARD_H_

//*****************************************************************************
//	インクルード
//*****************************************************************************
#include "CInput.h"

//	定義しない場合、キーボード操作は受け付けない
#define KEYBOARD_ON

//*****************************************************************************
//	クラス定義
//*****************************************************************************
class CKeyboard:public CInput
{
public:

	//*****************************************************************************
	//	関数定義
	//*****************************************************************************
	CKeyboard();
	~CKeyboard();
	bool Init(HINSTANCE _instanceHandle, HWND _windowHandle);
	void Update();
	bool GetPress(int _num){ return (press[_num] == 0x80) ? true : false; };
	bool GetTrigger(int _num){ return (trigger[_num] == 0x80) ? true : false; };
	bool GetRepeat(int _num){ return (repeat[_num] == 0x80) ? true : false; };
	bool GetRelease(int _num){ return (release[_num] == 0x80) ? true : false; };
	int GetTrigger();

private:

	//*****************************************************************************
	//	変数定義
	//*****************************************************************************
	BYTE press[256];		//	押下状態を格納するワーク
	BYTE pressOld[256];		//	1フレーム前の状態を格納するワーク
	BYTE release[256];		//	リリース情報を格納するワーク
	BYTE trigger[256];		//	トリガー情報を格納するワーク
	BYTE repeat[256];		//	リピート情報を格納するワーク
	int repeatCount[256];			//	リピート用カウント変数
};

#endif

//-----------------------------------EOF---------------------------------------