//*****************************************************************************
//	スクリーンショット処理 [ CScreenShot.cpp ]
//	Author : KOTARO NAGASAKI
//	create : 4/16
//	Update : 4/16
//*****************************************************************************

//*****************************************************************************
//	インクルード定義
//*****************************************************************************
#include "main.h"
#include "CScreenShot.h"

//*****************************************************************************
//	静的変数定義
//*****************************************************************************
int CScreenShot::index = 0;

//=============================================================================
//	コンストラクタ
//=============================================================================
CScreenShot::CScreenShot(LPDIRECT3DDEVICE9 _device, BOOL _window, HWND _windowHandle)
{
	Init(_device, _window, _windowHandle);
}
//=============================================================================
//	デストラクタ
//=============================================================================
CScreenShot::~CScreenShot()
{
}
//=============================================================================
//	初期化
//=============================================================================
void CScreenShot::Init(LPDIRECT3DDEVICE9 _device, BOOL _window, HWND _windowHandle)
{
	/*if (MessageBox(NULL, "スクリーンショットのインデックス番号をリセットしますか？", "スクリーンショット", MB_YESNO) == IDYES)
	{
		//	スクリーンショット数情報書き込み
		//-------------------------------------------------------------------------------
		FILE* fp;

		if ((fp = fopen("data/screenShot/screenShot.txt", "w")) == NULL)
		{
			ASSERT("スクリーンショット用ファイルのオープン失敗");
		}

		fputs("0", fp);

		fclose(fp);
		//-------------------------------------------------------------------------------
	}*/

	device = _device;
	windowMode = _window;
	windowHandle = _windowHandle;
}
//=============================================================================
//	作成
//=============================================================================
void CScreenShot::Create()
{
	LPDIRECT3DSURFACE9 pSurface;	//	サーフェース
	TCHAR fileName[100];	//	ファイル名
	FILE* fp;	//	ファイルポインタ
	char cImageNum[10];	//	読み書き用文字列
	int nImageNum = 0;	//	文字列から数字への変更

	//	ファイルからスクリーンショット数情報読み取り
	//-------------------------------------------------------------------------------
	if ((fp = fopen("data/screenShot/screenShot.txt", "r")) == NULL)
	{
		ASSERT("スクリーンショット用ファイルのオープン失敗");
	}

	fgets(cImageNum, 10, fp);

	fclose(fp);
	//-------------------------------------------------------------------------------

	//	ファイル名設定
	//-------------------------------------------------------------------------------
	//	文字列から数字への変換
	nImageNum = atoi(cImageNum);

	//	ファイル名保存( 識別子もここで保存 )
	sprintf(fileName, "data/screenShot/image%d.bmp", nImageNum);

	nImageNum++;

	//	数字から文字列への変換
	_itoa_s(nImageNum, cImageNum, 10);
	//-------------------------------------------------------------------------------

	//	スクリーンショット数情報書き込み
	//-------------------------------------------------------------------------------
	if ((fp = fopen("data/screenShot/screenShot.txt", "w")) == NULL)
	{
		ASSERT("スクリーンショット用ファイルのオープン失敗");
	}

	fputs(cImageNum, fp);

	fclose(fp);
	//-------------------------------------------------------------------------------

	device->GetRenderTarget(0, &pSurface);

	//	ウィンドウモード毎に処理変更
	if (windowMode == TRUE)
	{
		RECT rect;

		//	ウィンドウの座標を取得
		GetWindowRect(windowHandle, &rect);

		//	サーフェースの内容を指定のフォーマット、指定の名前で保存
		if (FAILED(D3DXSaveSurfaceToFile(fileName, D3DXIFF_BMP, pSurface, NULL, NULL)))
		{
			ASSERT("スクリーンショット撮影失敗");
		}
	}
	else
	{
		//	サーフェースの内容を指定のフォーマット、指定の名前で保存
		if (FAILED(D3DXSaveSurfaceToFile(fileName, D3DXIFF_BMP, pSurface, NULL, NULL)))
		{
			ASSERT("スクリーンショット撮影失敗");
		}
	}

	//	Get系で取得したサーフェイスはAddRefが呼ばれているので忘れずに解放する
	pSurface->Release();
}

//-----------------------------------EOF---------------------------------------