//*****************************************************************************
//	 [textures.cpp]
//	Author : KOTARO NAGASAKI
//*****************************************************************************

//*****************************************************************************
//	インクルード定義
//*****************************************************************************
#include "textures.h"

//*****************************************************************************
//	定数定義
//*****************************************************************************
const char *textureFileName[CTextures::TEXTYPE_MAX] =
{
	"data/texture/TeamLogo.png",
	"data/texture/effect.jpg",
};

//*****************************************************************************
//	静的変数定義
//*****************************************************************************
CTextures CTextures::textureInfo[CTextures::TEXTYPE_MAX];

//=============================================================================
//	初期化処理関数
//=============================================================================
void CTextures::Init(LPDIRECT3DDEVICE9 _device)
{
	//	使う全テクスチャを作成
	for (int count = 0; count < TEXTYPE_MAX; count++)
	{
		textureInfo[count].LoadTexture(_device, count);
	}
}
//=============================================================================
//	テクスチャロード処理関数
//=============================================================================
void CTextures::LoadTexture(LPDIRECT3DDEVICE9 _device, int _num)
{
	//	テクスチャ格納
	if (FAILED(
		D3DXCreateTextureFromFile(
			_device,
			textureFileName[_num],
			&texData)))
	{
		ASSERT("テクスチャ読み込み失敗");
	}
}
//=============================================================================
//	終了処理
//=============================================================================
void CTextures::Uninit()
{
	for (int count = 0; count < TEXTYPE_MAX; count++)
	{
		if (textureInfo[count].texData != NULL)
		{
			textureInfo[count].texData->Release();
			textureInfo[count].texData = NULL;
		}
	}
}
//=============================================================================
//	テクスチャポインタゲッター処理
//=============================================================================
CTextures* CTextures::GetTexture(TEXTURE_TYPE _textureNum)
{
	return &textureInfo[_textureNum];
}

//-----------------------------------EOF---------------------------------------