//==============================================================================
//
// File   : GraphicBlur.h
// Brief  : ブラー基描画処理の管理クラス
// Author : Taiga Shirakawa
// Date   : 2015/11/10 tue : Taiga Shirakawa : create
//
//==============================================================================

//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef MY_GRAPHIC_BLUR_BASE_H
#define MY_GRAPHIC_BLUR_BASE_H

//******************************************************************************
// インクルード
//******************************************************************************
#include "GraphicMain.h"

//******************************************************************************
// ライブラリ
//******************************************************************************

//******************************************************************************
// マクロ
//******************************************************************************

//******************************************************************************
// クラス前方宣言
//******************************************************************************
class Effect;
class EffectParameter;

//******************************************************************************
// クラス定義
//******************************************************************************
class GraphicBlur : public GraphicMain
{
public:
	//==============================================================================
	// Brief  : コンストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	GraphicBlur( void );

	//==============================================================================
	// Brief  : デストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	~GraphicBlur( void );

	//==============================================================================
	// Brief  : 初期化処理
	// Return : int									: 実行結果
	// Arg    : int priority						: 描画優先度
	// Arg    : const EffectParameter* pParameter	: エフェクトパラメータ
	// Arg    : Effect* pEffectX					: X方向ブラーエフェクト
	// Arg    : Effect* pEffectY					: Y方向ブラーエフェクト
	// Arg    : IDirect3DTexture9* pTextureX		: X方向ブラーを掛けるテクスチャ
	// Arg    : IDirect3DTexture9* pTextureY		: Y方向ブラーを掛けるテクスチャ
	//==============================================================================
	int Initialize( int priority, const EffectParameter* pParameter, Effect* pEffectX, Effect* pEffectY,
		IDirect3DTexture9* pTextureX, IDirect3DTexture9* pTextureY );

	//==============================================================================
	// Brief  : 終了処理
	// Return : int									: 実行結果
	// Arg    : void								: なし
	//==============================================================================
	int Finalize( void );

	//==============================================================================
	// Brief  : 再初期化処理
	// Return : int									: 実行結果
	// Arg    : int priority						: 描画優先度
	// Arg    : const EffectParameter* pParameter	: エフェクトパラメータ
	// Arg    : Effect* pEffectX					: X方向ブラーエフェクト
	// Arg    : Effect* pEffectY					: Y方向ブラーエフェクト
	// Arg    : IDirect3DTexture9* pTextureX		: X方向ブラーを掛けるテクスチャ
	// Arg    : IDirect3DTexture9* pTextureY		: Y方向ブラーを掛けるテクスチャ
	//==============================================================================
	int Reinitialize( int priority, const EffectParameter* pParameter, Effect* pEffectX, Effect* pEffectY,
		IDirect3DTexture9* pTextureX, IDirect3DTexture9* pTextureY );

	//==============================================================================
	// Brief  : クラスのコピー
	// Return : int									: 実行結果
	// Arg    : GraphicBlur* pOut					: コピー先アドレス
	//==============================================================================
	int Copy( GraphicBlur* pOut ) const;

protected:

private:
	void InitializeSelf( void );
	GraphicBlur( const GraphicBlur& );
	GraphicBlur operator=( const GraphicBlur& );

};

#endif	// MY_GRAPHIC_BLUR_BASE_H
