//==============================================================================
//
// File   : GraphicWaveData.h
// Brief  : 波情報描画処理の管理クラス
// Author : Taiga Shirakawa
// Date   : 2015/11/17 tue : Taiga Shirakawa : create
//
//==============================================================================

//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef MY_GRAPHIC_WAVE_DATA_H
#define MY_GRAPHIC_WAVE_DATA_H

//******************************************************************************
// インクルード
//******************************************************************************
#include "GraphicMain.h"

//******************************************************************************
// ライブラリ
//******************************************************************************

//******************************************************************************
// マクロ
//******************************************************************************

//******************************************************************************
// クラス前方宣言
//******************************************************************************
class Effect;
class EffectParameter;

//******************************************************************************
// クラス定義
//******************************************************************************
class GraphicWaveData : public GraphicMain
{
public:
	//==============================================================================
	// Brief  : コンストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	GraphicWaveData( void );

	//==============================================================================
	// Brief  : デストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	~GraphicWaveData( void );

	//==============================================================================
	// Brief  : 初期化処理
	// Return : int									: 実行結果
	// Arg    : int priority						: 描画優先度
	// Arg    : const EffectParameter* pParameter	: エフェクトパラメータ
	// Arg    : Effect* pEffect						: エフェクト
	// Arg    : IDirect3DTexture9* pTextureHeight0	: 高さテクスチャ0
	// Arg    : IDirect3DTexture9* pTextureHeight1	: 高さテクスチャ1
	//==============================================================================
	int Initialize( int priority, const EffectParameter* pParameter, Effect* pEffect,
		IDirect3DTexture9* pTextureHeight0, IDirect3DTexture9* pTextureHeight1 );

	//==============================================================================
	// Brief  : 終了処理
	// Return : int									: 実行結果
	// Arg    : void								: なし
	//==============================================================================
	int Finalize( void );

	//==============================================================================
	// Brief  : 再初期化処理
	// Return : int									: 実行結果
	// Arg    : int priority						: 描画優先度
	// Arg    : const EffectParameter* pParameter	: エフェクトパラメータ
	// Arg    : Effect* pEffect						: エフェクト
	// Arg    : IDirect3DTexture9* pTextureHeight0	: 高さテクスチャ0
	// Arg    : IDirect3DTexture9* pTextureHeight1	: 高さテクスチャ1
	//==============================================================================
	int Reinitialize( int priority, const EffectParameter* pParameter, Effect* pEffect,
		IDirect3DTexture9* pTextureHeight0, IDirect3DTexture9* pTextureHeight1 );

	//==============================================================================
	// Brief  : クラスのコピー
	// Return : int									: 実行結果
	// Arg    : GraphicWaveData* pOut				: コピー先アドレス
	//==============================================================================
	int Copy( GraphicWaveData* pOut ) const;

protected:

private:
	void InitializeSelf( void );
	GraphicWaveData( const GraphicWaveData& );
	GraphicWaveData operator=( const GraphicWaveData& );

};

#endif	// MY_GRAPHIC_WAVE_DATA_H
