//==============================================================================
//
// File   : Input.cpp
// Brief  : 入力クラス
// Author : Taiga Shirakawa
// Date   : 2015/10/11 sun : Taiga Shirakawa : create
//
//==============================================================================

//******************************************************************************
// インクルード
//******************************************************************************
#include "Input.h"

//******************************************************************************
// ライブラリ
//******************************************************************************
#pragma comment( lib, "dxguid.lib" )
#pragma comment( lib, "dinput8.lib" )

//******************************************************************************
// マクロ定義
//******************************************************************************

//******************************************************************************
// 静的メンバ変数
//******************************************************************************

//==============================================================================
// Brief  : コンストラクタ
// Return : 									: 
// Arg    : void								: なし
//==============================================================================
Input::Input( void )
{
	// クラス内の初期化処理
	InitializeSelf();
}

//==============================================================================
// Brief  : デストラクタ
// Return : 									: 
// Arg    : void								: なし
//==============================================================================
Input::~Input( void )
{
	// 終了処理
	Finalize();
}

//==============================================================================
// Brief  : 初期化処理
// Return : int									: 実行結果
// Arg    : IDirectInput8* pDirectInput			: DirectInputオブジェクト
// Arg    : HWND windowHandle					: ウィンドウハンドル
//==============================================================================
int Input::Initialize( IDirectInput8* pDirectInput, HWND windowHandle )
{
	// メンバ変数の設定
	pDirectInput_ = pDirectInput;

	// 正常終了
	return 0;
}

//==============================================================================
// Brief  : 終了処理
// Return : int									: 実行結果
// Arg    : void								: なし
//==============================================================================
int Input::Finalize( void )
{
	// デバイスオブジェクトの開放
	if( pDevice_ != nullptr )
	{
		pDevice_->Unacquire();
		pDevice_->Release();
		pDevice_ = nullptr;
	}

	// クラス内の初期化処理
	InitializeSelf();

	// 正常終了
	return 0;
}

//==============================================================================
// Brief  : 再初期化処理
// Return : int									: 実行結果
// Arg    : IDirectInput8* pDirectInput			: DirectInputオブジェクト
// Arg    : HWND windowHandle					: ウィンドウハンドル
//==============================================================================
int Input::Reinitialize( IDirectInput8* pDirectInput, HWND windowHandle )
{
	// 終了処理
	int		result;		// 実行結果
	result = Finalize();
	if( result != 0 )
	{
		return result;
	}

	// 初期化処理
	return Initialize( pDirectInput, windowHandle );
}

//==============================================================================
// Brief  : クラスのコピー
// Return : int									: 実行結果
// Arg    : Input* pOut							: コピー先アドレス
//==============================================================================
int Input::Copy( Input* pOut ) const
{
	// 正常終了
	return 0;
}

//==============================================================================
// Brief  : 更新処理
// Return : void								: なし
// Arg    : void								: なし
//==============================================================================
void Input::Update( void )
{
}

//==============================================================================
// Brief  : クラス内の初期化処理
// Return : void								: なし
// Arg    : void								: なし
//==============================================================================
void Input::InitializeSelf( void )
{
	// メンバ変数の初期化
	pDirectInput_ = nullptr;
	pDevice_ = nullptr;
}
