//==============================================================================
//
// File   : SceneSplash.h
// Brief  : スプラッシュシーンクラス
// Author : Taiga Shirakawa
// Date   : 2015/10/13 tue : Taiga Shirakawa : create
//
//==============================================================================

//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef MY_SCENE_SPLASH_H
#define MY_SCENE_SPLASH_H

//******************************************************************************
// インクルード
//******************************************************************************
#include "../system/SceneMain.h"

//******************************************************************************
// ライブラリ
//******************************************************************************

//******************************************************************************
// マクロ
//******************************************************************************

//******************************************************************************
// クラス前方宣言
//******************************************************************************
class CameraObject;
class LightDirection;
class LightPoint;
class ManagerPoint;
class Material;
class ObjectMesh;
class ObjectModel;
class ObjectSky;

//******************************************************************************
// クラス定義
//******************************************************************************
class SceneSplash : public SceneMain
{
public:
	//==============================================================================
	// Brief  : コンストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	SceneSplash( void );

	//==============================================================================
	// Brief  : デストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	~SceneSplash( void );

	//==============================================================================
	// Brief  : 初期化処理
	// Return : int									: 実行結果
	// Arg    : SceneArgumentMain* pArgument		: シーン引数
	//==============================================================================
	int Initialize( SceneArgumentMain* pArgument );

	//==============================================================================
	// Brief  : 終了処理
	// Return : int									: 実行結果
	// Arg    : void								: なし
	//==============================================================================
	int Finalize( void );

	//==============================================================================
	// Brief  : 再初期化処理
	// Return : int									: 実行結果
	// Arg    : SceneArgumentMain* pArgument		: シーン引数
	//==============================================================================
	int Reinitialize( SceneArgumentMain* pArgument );

	//==============================================================================
	// Brief  : クラスのコピー
	// Return : int									: 実行結果
	// Arg    : SceneSplash* pOut					: コピー先アドレス
	//==============================================================================
	int Copy( SceneSplash* pOut ) const;

	//==============================================================================
	// Brief  : 更新処理
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void Update( void );

protected:

private:
	void InitializeSelf( void );
	SceneSplash( const SceneSplash& );
	SceneSplash operator=( const SceneSplash& );

	CameraObject*		pCamera_;			// カメラ
	LightDirection*		pLight_;			// ライト
	LightPoint*			pPointLight_;		// ポイントライト

	ManagerPoint*		pPoint_;			// ポイントスプライト管理クラス

	static const int	COUNT_MODEL = 10;		// モデル数

	ObjectMesh*			pObjectMesh_;		// メッシュ
	ObjectSky*			pObjectSky_;		// スカイドーム
	ObjectModel*		pObjectModel_;		// モデル
};

#endif	// MY_SCENE_SPLASH_H
