//==============================================================================
//
// File   : SceneTitle.h
// Brief  : タイトルシーンクラス
// Author : Taiga Shirakawa
// Date   : 2015/10/13 tue : Taiga Shirakawa : create
//
//==============================================================================

//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef MY_SCENE_TITLE_H
#define MY_SCENE_TITLE_H

//******************************************************************************
// インクルード
//******************************************************************************
#include "../system/SceneMain.h"

//******************************************************************************
// ライブラリ
//******************************************************************************

//******************************************************************************
// マクロ
//******************************************************************************

//******************************************************************************
// クラス前方宣言
//******************************************************************************
class CameraObject;
class LightDirection;

class Object2D;
class Object3D;
class Material;
class ObjectModel;
class PolygonMesh;
class ObjectMesh;

//******************************************************************************
// クラス定義
//******************************************************************************
class SceneTitle : public SceneMain
{
public:
	//==============================================================================
	// Brief  : コンストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	SceneTitle( void );

	//==============================================================================
	// Brief  : デストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	~SceneTitle( void );

	//==============================================================================
	// Brief  : 初期化処理
	// Return : int									: 実行結果
	// Arg    : SceneArgumentMain* pArgument		: シーン引数
	//==============================================================================
	int Initialize( SceneArgumentMain* pArgument );

	//==============================================================================
	// Brief  : 終了処理
	// Return : int									: 実行結果
	// Arg    : void								: なし
	//==============================================================================
	int Finalize( void );

	//==============================================================================
	// Brief  : 再初期化処理
	// Return : int									: 実行結果
	// Arg    : SceneArgumentMain* pArgument		: シーン引数
	//==============================================================================
	int Reinitialize( SceneArgumentMain* pArgument );

	//==============================================================================
	// Brief  : クラスのコピー
	// Return : int									: 実行結果
	// Arg    : SceneTitle* pOut					: コピー先アドレス
	//==============================================================================
	int Copy( SceneTitle* pOut ) const;

	//==============================================================================
	// Brief  : 更新処理
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void Update( void );

	//==============================================================================
	// Brief  : 更新処理1(「Aボタンを押してね」の点滅)
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void FirstUpdate( void );

	//==============================================================================
	// Brief  : 更新処理2(ゲーム開始・チュートリアル開始の選択処理)
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void SecondUpdate( void );

protected:

private:
	void InitializeSelf( void );
	SceneTitle( const SceneTitle& );
	SceneTitle operator=( const SceneTitle& );

	CameraObject*		pCamera_;				// カメラ
	LightDirection*		pLight_;				// ライト

	Object2D* titleLogo;
	Object2D* startGame;
	Object2D* startTutorial;
	Object2D* pushAKey;

	Object2D* chooseObject;	//	選択肢のうち、選ばれているオブジェクトのポインタ

	int pushAKeyFlashingCount;	//	pushAKey点滅用
	int pushChooseObjectFlashingCount;	//	chooseObject点滅用

	void (SceneTitle::*fpUpdate)(void);
};

#endif	// MY_SCENE_TITLE_H
