//==============================================================================
//
// File   : SceneTitle.h
// Brief  : タイトルシーンクラス
// Author : Taiga Shirakawa
// Date   : 2015/10/13 tue : Taiga Shirakawa : create
//
//==============================================================================

//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef MY_SCENE_TITLE_H
#define MY_SCENE_TITLE_H

//******************************************************************************
// インクルード
//******************************************************************************
#include "../system/SceneMain.h"

//******************************************************************************
// ライブラリ
//******************************************************************************

//******************************************************************************
// マクロ
//******************************************************************************

//******************************************************************************
// クラス前方宣言
//******************************************************************************
class CameraObject;
class LightDirection;

class Object2D;
class Object3D;
class Material;
class ObjectModel;
class PolygonMesh;
class ObjectMesh;

//******************************************************************************
// クラス定義
//******************************************************************************
class SceneTitle : public SceneMain
{
public:
	//==============================================================================
	// Brief  : コンストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	SceneTitle( void );

	//==============================================================================
	// Brief  : デストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	~SceneTitle( void );

	//==============================================================================
	// Brief  : 初期化処理
	// Return : int									: 実行結果
	// Arg    : SceneArgumentMain* pArgument		: シーン引数
	//==============================================================================
	int Initialize( SceneArgumentMain* pArgument );

	//==============================================================================
	// Brief  : 終了処理
	// Return : int									: 実行結果
	// Arg    : void								: なし
	//==============================================================================
	int Finalize( void );

	//==============================================================================
	// Brief  : 再初期化処理
	// Return : int									: 実行結果
	// Arg    : SceneArgumentMain* pArgument		: シーン引数
	//==============================================================================
	int Reinitialize( SceneArgumentMain* pArgument );

	//==============================================================================
	// Brief  : クラスのコピー
	// Return : int									: 実行結果
	// Arg    : SceneTitle* pOut					: コピー先アドレス
	//==============================================================================
	int Copy( SceneTitle* pOut ) const;

	//==============================================================================
	// Brief  : 更新処理
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void Update( void );

protected:

private:
	void InitializeSelf( void );
	SceneTitle( const SceneTitle& );
	SceneTitle operator=( const SceneTitle& );

	CameraObject*		pCamera_;				// カメラ
	LightDirection*		pLight_;				// ライト

	//	タイトルロゴ
	Object2D* titleLogo;

	//	「演舞開始」文字
	Object2D* startGame;

	//	「練習開始」文字
	Object2D* startTutorial;

	//	「Aボタンを押してね」文字
	Object2D* pushAKey;

	//	wiiリモコンで操作する指
	Object2D* finger;

	//	選択肢のうち、選ばれているオブジェクトのポインタ
	Object2D* chooseObject;
	Object2D* chooseObjectPrev;

	//	プレイヤーオブジェクト
	ObjectModel* player;

	//	家オブジェクト
	ObjectModel* house[3];

	//	仮フィールド
	ObjectMesh* field;

	//	pushAKey点滅用
	int pushAKeyFlashingCount;

	//	chooseObject点滅用
	int pushChooseObjectFlashingCount;

	//	選択肢の選択方法用のフラグ
	//	true = wiiリモコン（IR）
	//	false = 方向キー	とする
	bool chooseFlag;

	//==============================================================================
	// Brief  : 更新処理1(「Aボタンを押してね」の点滅)
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void firstUpdate( void );

	//==============================================================================
	// Brief  : 更新処理2(ゲーム開始・チュートリアル開始の選択処理)
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void secondUpdate( void );

	//==============================================================================
	// Brief  : 更新処理3(決定キー押された後の点滅処理-ゲームへ遷移)
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void thirdUpdate( void );

	//==============================================================================
	// Brief  : 更新処理4(決定キー押された後の点滅処理-チュートリアルへ遷移)
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void forthUpdate( void );

	void (SceneTitle::*fpUpdate)(void);
};

#endif	// MY_SCENE_TITLE_H
