//==============================================================================
//
// File   : ObjectWaveData.h
// Brief  : 波情報描画オブジェクトクラス
// Author : Taiga Shirakawa
// Date   : 2015/11/17 tue : Taiga Shirakawa : create
//
//==============================================================================

//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef MY_OBJECT_WAVE_DATA_H
#define MY_OBJECT_WAVE_DATA_H

//******************************************************************************
// インクルード
//******************************************************************************
#include "../framework/object/object.h"

//******************************************************************************
// ライブラリ
//******************************************************************************

//******************************************************************************
// マクロ
//******************************************************************************

//******************************************************************************
// クラス前方宣言
//******************************************************************************
class Effect;
class EffectParameter;
class GraphicWaveData;

//******************************************************************************
// クラス定義
//******************************************************************************
class ObjectWaveData : public Object
{
public:
	//==============================================================================
	// Brief  : コンストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	ObjectWaveData( void );

	//==============================================================================
	// Brief  : デストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	~ObjectWaveData( void );

	//==============================================================================
	// Brief  : 初期化処理
	// Return : int									: 実行結果
	// Arg    : int priority						: 更新優先度
	//==============================================================================
	int Initialize( int priority );

	//==============================================================================
	// Brief  : 終了処理
	// Return : int									: 実行結果
	// Arg    : void								: なし
	//==============================================================================
	int Finalize( void );

	//==============================================================================
	// Brief  : 再初期化処理
	// Return : int									: 実行結果
	// Arg    : int priority						: 更新優先度
	//==============================================================================
	int Reinitialize( int priority );

	//==============================================================================
	// Brief  : クラスのコピー
	// Return : int									: 実行結果
	// Arg    : ObjectWaveData* pOut				: コピー先アドレス
	//==============================================================================
	int Copy( ObjectWaveData* pOut ) const;

	//==============================================================================
	// Brief  : 更新処理
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void Update( void );

	//==============================================================================
	// Brief  : 描画クラスの生成
	// Return : int									: 実行結果
	// Arg    : int priority						: 描画優先度
	// Arg    : const EffectParameter* pParameter	: エフェクトパラメータ
	// Arg    : Effect* pEffect						: エフェクト
	// Arg    : IDirect3DTexture9* pTextureHeight0	: 高さテクスチャ0
	// Arg    : IDirect3DTexture9* pTextureHeight1	: 高さテクスチャ1
	//==============================================================================
	int CreateGraphic( int priority, const EffectParameter* pParameter, Effect* pEffect,
		IDirect3DTexture9* pTextureHeight0, IDirect3DTexture9* pTextureHeight1 );

	//==============================================================================
	// アクセサ
	//==============================================================================
	void SetGraphic( GraphicWaveData* pValue );
	GraphicWaveData* GetGraphic( void ) const;

protected:
	GraphicWaveData*	pGraphic_;		// 描画クラス

private:
	void InitializeSelf( void );
	ObjectWaveData( const ObjectWaveData& );
	ObjectWaveData operator=( const ObjectWaveData& );

};

#endif	// MY_OBJECT_BLUR_BASE_H
