//==============================================================================
//
// File   : ObjectScreen.h
// Brief  : 画面ポリゴンオブジェクトクラス
// Author : Taiga Shirakawa
// Date   : 2015/10/17 sat : Taiga Shirakawa : create
//
//==============================================================================

//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef MY_OBJECT_SCREEN_H
#define MY_OBJECT_SCREEN_H

//******************************************************************************
// インクルード
//******************************************************************************
#include "../framework/object/ObjectMovement.h"

//******************************************************************************
// ライブラリ
//******************************************************************************

//******************************************************************************
// マクロ
//******************************************************************************

//******************************************************************************
// クラス前方宣言
//******************************************************************************
class Effect;
class EffectParameter;
class Fade;
class GraphicScreen;
class Texture;

//******************************************************************************
// クラス定義
//******************************************************************************
class ObjectScreen : public ObjectMovement
{
public:
	//==============================================================================
	// Brief  : コンストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	ObjectScreen( void );

	//==============================================================================
	// Brief  : デストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	~ObjectScreen( void );

	//==============================================================================
	// Brief  : 初期化処理
	// Return : int									: 実行結果
	// Arg    : int priority						: 更新優先度
	// Arg    : Fade* pFade							: フェード
	//==============================================================================
	int Initialize( int priority, Fade* pFade );

	//==============================================================================
	// Brief  : 終了処理
	// Return : int									: 実行結果
	// Arg    : void								: なし
	//==============================================================================
	int Finalize( void );

	//==============================================================================
	// Brief  : 再初期化処理
	// Return : int									: 実行結果
	// Arg    : int priority						: 更新優先度
	// Arg    : Fade* pFade							: フェード
	//==============================================================================
	int Reinitialize( int priority, Fade* pFade );

	//==============================================================================
	// Brief  : クラスのコピー
	// Return : int									: 実行結果
	// Arg    : ObjectScreen* pOut						: コピー先アドレス
	//==============================================================================
	int Copy( ObjectScreen* pOut ) const;

	//==============================================================================
	// Brief  : 更新処理
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void Update( void );

	//==============================================================================
	// Brief  : 描画クラスの生成
	// Return : int									: 実行結果
	// Arg    : int priority						: 描画優先度
	// Arg    : const EffectParameter* pParameter	: エフェクトパラメータ
	// Arg    : Effect* pEffectGeneral				: 通常描画エフェクト
	// Arg    : IDirect3DTexture9* pTexture3D		: 3D描画テクスチャ
	// Arg    : IDirect3DTexture9* pTexture2D		: 2D描画テクスチャ
	// Arg    : IDirect3DTexture9* pTextureMask		: マスクテクスチャ
	// Arg    : Texture* pTexture					: テクスチャ
	//==============================================================================
	int CreateGraphic( int priority, const EffectParameter* pParameter, Effect* pEffectGeneral,
		IDirect3DTexture9* pTexture3D, IDirect3DTexture9* pTexture2D, IDirect3DTexture9* pTextureMask, Texture* pTexture = nullptr );

	//==============================================================================
	// アクセサ
	//==============================================================================
	void SetGraphic( GraphicScreen* pValue );
	GraphicScreen* GetGraphic( void ) const;

protected:
	GraphicScreen*	pGraphic_;		// 描画クラス

private:
	void InitializeSelf( void );
	ObjectScreen( const ObjectScreen& );
	ObjectScreen operator=( const ObjectScreen& );

	Fade*	pFade_;					// フェード
	float	proportionFade_;		// フェード割合
};

#endif	// MY_OBJECT_SCREEN_H
