//==============================================================================
//
// File   : ObjectBlur.h
// Brief  : ブラー基描画オブジェクトクラス
// Author : Taiga Shirakawa
// Date   : 2015/11/10 tue : Taiga Shirakawa : create
//
//==============================================================================

//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef MY_OBJECT_BLUR_BASE_H
#define MY_OBJECT_BLUR_BASE_H

//******************************************************************************
// インクルード
//******************************************************************************
#include "../framework/object/object.h"

//******************************************************************************
// ライブラリ
//******************************************************************************

//******************************************************************************
// マクロ
//******************************************************************************

//******************************************************************************
// クラス前方宣言
//******************************************************************************
class Effect;
class EffectParameter;
class GraphicBlur;

//******************************************************************************
// クラス定義
//******************************************************************************
class ObjectBlur : public Object
{
public:
	//==============================================================================
	// Brief  : コンストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	ObjectBlur( void );

	//==============================================================================
	// Brief  : デストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	~ObjectBlur( void );

	//==============================================================================
	// Brief  : 初期化処理
	// Return : int									: 実行結果
	// Arg    : int priority						: 更新優先度
	//==============================================================================
	int Initialize( int priority );

	//==============================================================================
	// Brief  : 終了処理
	// Return : int									: 実行結果
	// Arg    : void								: なし
	//==============================================================================
	int Finalize( void );

	//==============================================================================
	// Brief  : 再初期化処理
	// Return : int									: 実行結果
	// Arg    : int priority						: 更新優先度
	//==============================================================================
	int Reinitialize( int priority );

	//==============================================================================
	// Brief  : クラスのコピー
	// Return : int									: 実行結果
	// Arg    : ObjectBlur* pOut					: コピー先アドレス
	//==============================================================================
	int Copy( ObjectBlur* pOut ) const;

	//==============================================================================
	// Brief  : 更新処理
	// Return : void								: なし
	// Arg    : void								: なし
	//==============================================================================
	void Update( void );

	//==============================================================================
	// Brief  : 描画クラスの生成
	// Return : int									: 実行結果
	// Arg    : int priority						: 描画優先度
	// Arg    : const EffectParameter* pParameter	: エフェクトパラメータ
	// Arg    : Effect* pEffectX					: X方向ブラーエフェクト
	// Arg    : Effect* pEffectY					: Y方向ブラーエフェクト
	// Arg    : IDirect3DTexture9* pTextureX		: X方向ブラーを掛けるテクスチャ
	// Arg    : IDirect3DTexture9* pTextureY		: Y方向ブラーを掛けるテクスチャ
	//==============================================================================
	int CreateGraphic( int priority, const EffectParameter* pParameter, Effect* pEffectX, Effect* pEffectY,
		IDirect3DTexture9* pTextureX, IDirect3DTexture9* pTextureY );

	//==============================================================================
	// アクセサ
	//==============================================================================
	void SetGraphic( GraphicBlur* pValue );
	GraphicBlur* GetGraphic( void ) const;

protected:
	GraphicBlur*	pGraphic_;		// 描画クラス

private:
	void InitializeSelf( void );
	ObjectBlur( const ObjectBlur& );
	ObjectBlur operator=( const ObjectBlur& );

};

#endif	// MY_OBJECT_BLUR_BASE_H
