//==============================================================================
//
// File   : RenderPassParameter.h
// Brief  : 描画パスパラメータ
// Author : Taiga Shirakawa
// Date   : 2015/10/31 sat : Taiga Shirakawa : create
//
//==============================================================================

//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef MY_RENDER_PASS_PARAMETER_H
#define MY_RENDER_PASS_PARAMETER_H

//******************************************************************************
// インクルード
//******************************************************************************
#include "d3dx9.h"

//******************************************************************************
// ライブラリ
//******************************************************************************

//******************************************************************************
// マクロ
//******************************************************************************

//******************************************************************************
// クラス前方宣言
//******************************************************************************

//******************************************************************************
// クラス定義
//******************************************************************************
class RenderPassParameter
{
public:
	//==============================================================================
	// Brief  : コンストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	RenderPassParameter( void );

	//==============================================================================
	// Brief  : デストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	~RenderPassParameter( void );

	static const int	MAXIMUM_RENDER_TARGET = 16;		// 最大レンダーターゲット数

	int					width_;											// 幅
	int					height_;										// 高さ
	D3DFORMAT			pFormat_[ MAXIMUM_RENDER_TARGET ];				// レンダーターゲットの形式
	int					pCountMultiple_[ MAXIMUM_RENDER_TARGET ];		// 順番に描画する枚数
	DWORD				flagClear_;										// クリアフラグ
	D3DCOLOR			clearTarget_;									// レンダーターゲットのクリア値
	float				clearZBuffer_;									// Zバッファのクリア値
	DWORD				clearStencil_;									// ステンシルバッファのクリア値
	IDirect3DSurface9*	pSurfaceDepth_;									// 深度バッファ

protected:

private:
	void InitializeSelf( void );
	RenderPassParameter( const RenderPassParameter& );
	RenderPassParameter operator=( const RenderPassParameter& );
};

#endif	// MY_RENDER_PASS_PARAMETER_H
