//==============================================================================
//
// File   : ManagerTexture.h
// Brief  : テクスチャ管理クラス
// Author : Taiga Shirakawa
// Date   : 2015/10/15 thu : Taiga Shirakawa : create
//
//==============================================================================

//******************************************************************************
// インクルードガード
//******************************************************************************
#ifndef MY_MANAGER_TEXTURE_H
#define MY_MANAGER_TEXTURE_H

//******************************************************************************
// インクルード
//******************************************************************************
#include "d3dx9.h"
#include "ManagerResource.h"

//******************************************************************************
// ライブラリ
//******************************************************************************

//******************************************************************************
// マクロ
//******************************************************************************

//******************************************************************************
// クラス前方宣言
//******************************************************************************
class Texture;

//******************************************************************************
// クラス定義
//******************************************************************************
template< class TypeItem >
class ManagerTexture : public ManagerResource< TypeItem >
{
public:
	//==============================================================================
	// Brief  : コンストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	ManagerTexture( void );

	//==============================================================================
	// Brief  : デストラクタ
	// Return : 									: 
	// Arg    : void								: なし
	//==============================================================================
	~ManagerTexture( void );

	//==============================================================================
	// Brief  : 初期化処理
	// Return : int									: 実行結果
	// Arg    : TCHAR* pDirectory					: 基準ディレクトリ
	// Arg    : int maximumItem						: 最大要素数
	// Arg    : IDirect3DDevice9* pDevice			: Direct3Dデバイス
	//==============================================================================
	int Initialize( TCHAR* pDirectory, int maximumItem, IDirect3DDevice9* pDevice );

	//==============================================================================
	// Brief  : 終了処理
	// Return : int									: 実行結果
	// Arg    : void								: なし
	//==============================================================================
	int Finalize( void );

	//==============================================================================
	// Brief  : 再初期化処理
	// Return : int									: 実行結果
	// Arg    : TCHAR* pDirectory					: 基準ディレクトリ
	// Arg    : int maximumItem						: 最大要素数
	// Arg    : IDirect3DDevice9* pDevice			: Direct3Dデバイス
	//==============================================================================
	int Reinitialize( TCHAR* pDirectory, int maximumItem, IDirect3DDevice9* pDevice );

	//==============================================================================
	// Brief  : クラスのコピー
	// Return : int									: 実行結果
	// Arg    : ManagerTexture* pOut				: コピー先アドレス
	//==============================================================================
	int Copy( ManagerTexture* pOut ) const;

protected:

private:
	void InitializeSelf( void );
	ManagerTexture( const ManagerTexture& );
	ManagerTexture operator=( const ManagerTexture& );

	int LoadResource( TCHAR* pPath, int index );
	void ReleaseResource( int index );

	IDirect3DDevice9*	pDevice_;		// Direct3Dデバイス
};

#endif	// MY_MANAGER_TEXTURE_H
